Repository: stjordanis/nelson
Catalog: locale/*/LC_MESSAGES/nelson.po
Languages: it_it

source: Cannot apply numeric operation
it_it: L'operazione numerica non si può applicare

source: to reference types.
it_it: ai tipi di riferimento.

source: Same reference type expected.
it_it: Previsto lo stesso tipo di riferimento.

source: Size mismatch on arguments to arithmetic operator
it_it: Incongruenza di dimensione sugli argomenti dell'operatore aritmetico

source: Cannot apply matrix operation
it_it: L'operazione matrice non può essere applicata

source: to N-Dimensional arrays.
it_it: al vettore di N dimensioni.

source: Size mismatch on arguments to
it_it: Incongruenza di dimensioni sugli argomenti di

source: empty string not allowed as expected message.
it_it: stringa vuota non permessa come messaggio previsto.

source: Assertion failed : expected error message =
it_it: Asserzione fallita : previsto messaggio di errore =

source: computed error message =
it_it: messaggio di errore calcolato =

source: No error was produced while evaluating command.
it_it: Non è stato prodotto alcun errore durante la valutazione del comando.

source: isapprox returns more than one output argument.
it_it: isapprox restituisce più di un solo argomento di output.

source: isapprox must return an logical.
it_it: isapprox deve restituire un logico.

source: Assertion failed: expected and computed values are too different.
it_it: Asserzione fallita: i valori previsti e quelli calcolati sono troppo diversi.

source: isequalto returns more than one output argument.
it_it: isequalto restituisce più di un solo argomento di output.

source: isequalto must return an logical.
it_it: isequalto deve restituire un logico.

source: isequalto returns an unexpected error.
it_it: isequalto restituisce un errore inaspettato.

source: Assertion failed: expected and computed values are different.
it_it: Asserzione fallita: i valori previsti e quelli calcolati sono troppo diversi.

source: Assertion failed: found false entry in condition = true.
it_it: Asserzione fallita: trovata voce falsa nella condizione = true.

source: Assertion failed: found false entry in condition = false.
it_it: Asserzione fallita: trovata voce falsa nella condizione = false.

source: Wrong value for #1 argument.
it_it: Valore sbagliato come argomento numero 1.

source: Wrong value for #3 argument.
it_it: Valore sbagliato come argomento numero 3.

source: Cannot create audioplayer handle.
it_it: Non può essere creata una gestione audioplayer.

source: audioplayer handle expected.
it_it: gestione autoplayer prevista.

source: start >= 1 expected.
it_it: start >= 1 previsto.

source: Index >= 1 expected.
it_it: Index >= 1 previsto.

source: scalar or [start, end] vector expected.
it_it: vettore scalare o di tipo [start, end] previsto.

source: Invalid range.
it_it: Range non valido.

source: No property for class: audioplayer.
it_it: Nessuna proprietà per la classe: audioplayer.

source: Properties for class: audioplayer:
it_it: Proprietà per la classe: audioplayer:

source: Cannot set a read only property.
it_it: Non si può impostare una proprietà di sola lettura.

source: [start, end] vector expected.
it_it: Vettore di tipo [start, end] previsto.

source: Wrong value for #2 argument.
it_it: Valore sbagliato come argomento numero 2.

source: Wrong value for #1 or #2 argument.
it_it: Valore sbagliato come argomento numero 1 o 2.

source: Wrong value for #4 argument.
it_it: Valore sbagliato come argomento numero 4.

source: Invalid filename.
it_it: Nome file non valido.

source: No tags available.
it_it: Nessun tag disponibile.

source: Cannot save file.
it_it: Non si può salvare il file.

source: Wrong device ID.
it_it: ID dispositivo sbagliato.

source: Empty matrix not allowed.
it_it: Matrice vuota non permessa.

source: Vector or matrix 2D expected.
it_it: Vettore o matrice 2D prevista.

source: Too many output channels.
it_it: Troppi canali di output.

source: Type not supported.
it_it: Tipo non supportato.

source: 'native' or 'double' expected.
it_it: 'native' oppure 'double' previsto.

source: Cannot read audio file.
it_it: Il file audio non può essere letto.

source: Invalid file extension.
it_it: Estensione del file non valida.

source: Invalid BitsPerSample value.
it_it: Valore BitsPerSample non valido.

source: Write failed.
it_it: Scrittura fallita.

source: Filename must have an extension.
it_it: Il nome del file deve avere un'estensione.

source: audioplayer valid handle expected.
it_it: prevista gestione audioplayer valida.

source: 'machine' value expected.
it_it: valore 'machine' previsto.

source: Not implemented on this platform.
it_it: Non implementato su questa piattaforma.

source: Unrecognized option. "-full" expected.
it_it: Opzione non riconosciuta. "-full" previsto.

source: Error CLSIDFromString.
it_it: Errore

source: Error CLSIDFromProgID.
it_it: Errore CLSIDFromProgID.

source: Error CoCreateInstanceEx.
it_it: Errore

source: Invalid PROGID.
it_it: PROGID invalido.

source: Server is not running on this system.
it_it: Il server non è attivo su questo sistema.

source: Fails to connect to server.
it_it: Connessione al server fallita.

source: COM handle expected.
it_it: Gestione COM prevista.

source: COM valid handle expected.
it_it: Prevista una gestione COM valida.

source: IDispatch not defined.
it_it: IDispatch non definito.

source: method not found.
it_it: metodo non trovato.

source: Error detected:
it_it: Trovato errore:

source: Only 7 input parameters expected.
it_it: Previsti solo 7 parametri di input.

source: VARIANT conversion fails.
it_it: Conversione VARIANT fallisce.

source: Sparse not supported.
it_it: Sparse non supportato.

source: N dimensions array not supported.
it_it: Vettori di N dimensioni non supportati.

source: Unrecognized option. "s" expected.
it_it: Opzione non riconosciuta. "s" previsto.

source: Type 'double' or 'single' expected.
it_it: Tipo 'double' o 'single' previsto.

source: N-dimensional arrays are not supported.
it_it: I vettori di N dimensioni non sono supportati.
